12/data/attachments/6cba747501a2141e.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_friends_d687860b-2364-4b89-af16-4ccb3a34a4c6</nif:username>
            <nif:friendToBeAdded>Samuel_miss_Friend_70047_5</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>